In [1]:
import pandas as pd

In [2]:
#Q1.
l = {'a':[4,8,15,16,23,42]}

In [3]:
pd.DataFrame(l)

    a
0   4
1   8
2  15
3  16
4  23
5  42

In [4]:
#Q2.
a = ['a','b','c','d','e','f','g','h','i','j']

In [5]:
l = [1,2,3,4,5,6,7,8,9,10]

In [6]:
pd.Series(list(a), index =l )

1     a
2     b
3     c
4     d
5     e
6     f
7     g
8     h
9     i
10    j
dtype: object

In [7]:
#Q3.
d= {"Name":['Alice','Bob','Claire'],
   "Age":[25,30,27],
   "Gender":['Female','Male','Female']}

In [8]:
pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [9]:
#Q4.
#As noted in the table, a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

df = pd.DataFrame(d)

In [10]:
#DATAFRAME EXAMPLE
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
#Series EXAMPLE
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [12]:
#Q5.
#One of the common tasks in data analytics is manipulating values in your dataframes. For those of you who are familiar with Pandas, you know that in general you have three functions that you can use â€” map(), apply(), and applymap().
#EXAMPLE = we can add new column with new age.

In [13]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
df["New_Age"]= df["Age"].apply(lambda x : x*2)

In [15]:
df

     Name  Age  Gender  New_Age
0   Alice   25  Female       50
1     Bob   30    Male       60
2  Claire   27  Female       54

In [16]:
#Q6.
#All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

In [27]:
#Q7.
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

df=pd.concat([courses,fees,discount],axis=1)

In [28]:
df

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000